app/controllers/comments_controller.rb

  def create
    post = Post.find(params[:id])
    comment = Comment.new(comment_params)
    comment.user = current_user
    comment.post = post
    if comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "rrrrrrrrrrrrrrrrrrrrrrrrrrrrr"], ["user_id", 5], ["post_id", 6], ["created_at", "2023-12-21 15:49:18.695765"], ["updated_at", "2023-12-21 15:49:18.695765"]]