app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def show
    @hide_navbar = true
    @post = Post.find(params[:id])
    @comments = Comment.where(post: @post)
    @author = User.find(@post.user_id)